loadtest/artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 20
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: application/json
scenarios:
  - name: products list
    flow:
      - get:
          url: "/api/products"
  - name: signup + login + create product
    variables:
      n: "{{ $randomNumber(1,100000) }}"
      email: "user_{{ n }}@test.com"
    flow:
      - post:
          url: "/api/auth/signup"
          json:
            email: "{{ email }}"
            password: "secret12"
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "secret12"
          capture:
            - json: $.accessToken
              as: token
      - post:
          url: "/api/products"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            name: "EcoBottle Test"
            price: 1999
            imageUrl: "https://picsum.photos/seed/artillery/600/600"